In [1]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
s = pd.Series([4,8,15,16,23,42],index=['a','b','c','d','e','f'])

In [3]:
s

a     4
b     8
c    15
d    16
e    23
f    42
dtype: int64

<hr>Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [4]:
l = ["harsh",22,"jalan","Btech","ratangarh","churu","rajasthan",8107567588,"electrical",8.48,"IITRAM"]
s = pd.Series(l)

In [5]:
s

0          harsh
1             22
2          jalan
3          Btech
4      ratangarh
5          churu
6      rajasthan
7     8107567588
8     electrical
9           8.48
10        IITRAM
dtype: object

<hr>Q3. Create a Pandas DataFrame that contains the following data:

In [6]:
df = pd.DataFrame({"Name":['Alice','Bob','Claire'],"Age":[25,30,27],"Gender":['Female','Male','Femae']})
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27   Femae

<hr>Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.<br>
Ans. DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. a Pandas Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column.<hr>

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?<br>
Ans. Dropna(),fillna(),df.loc(),df.iloc(), df.info(), df.describe() etc are some kind of common function.<br>
dropna and fillna function is used to handle missing data in dataframes, df.loc and df.iloc() is used for display specific row and column data, df.describe function is used for getting information about dataframes.<hr>

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?<br>
Ans. Pandas DataFrame, Panel is mutable but series is immutable.
<hr>

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [7]:
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

df=pd.concat([courses,fees,discount],axis=1)
df

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000